/** 系统全局字典 */
export const GlobalDicts = {
    /** 施工端 */
    Construction: {
        /** 注册用户 */
        User: {
            /** 用户类型 */
            Type: { 1: '工人', 2: '设计师' },
            /** 用户状态 */
            Status: {
                /** 认证状态 */
                Certification: { 0: '未提交', 1: '未审核', 4: '未通过', 5: '通过' },
                /** 培训状态 */
                Training: { 0: '未培训', 4: '未通过', 5: '通过' }
            },
            Skill: {
                801: '拆改',
                802: '水电',
                803: '泥工',
                804: '木工',
                805: '油漆',
                806: '地板'
            },
            Style: {
                901: '简约',
                902: '中式',
                903: '日式',
                904: '现代',
                905: '新古典',
                907: '欧式',
                908: '宜家',
                909: '混搭',
                910: '北欧',
                911: '东南亚',
                912: '简欧',
                913: '美式',
                914: '地中海'
            }
        }
    },
    /** 用户管理 */
    Client: {
        /** 工程管理 */
        Project: {
            /** 工程类型 */
            Types: { 10: '单项需求', 1: '全包', 2: '半包', 3: '轻包'}
        },
        /** 订单管理 */
        Order: {
            /** 支付方式 */
            PayWay: { 0: '未支付', 1: '支付宝', 2: '微信'}
        }
    },
    /** 系统管理 */
    System: {
        /** App管理 */
        PhoneApp: {
            /** 终端类型 */
            Type: { 1: 'Android 用户端', 2: 'iOS 用户端', 3: 'Android 施工端', 4: 'iOS 施工端', 5: 'Android 管理端', 6: 'iOS 管理端'}
        }
    },
    /** 材料 */
    Material: {
        /** 供应商 */
        Provider: {
            /** 供应商级别 */
            Level: { 1: '1级', 2: '2级', 3: '3级' }
        },
        /** 材料审核状态 */
        State: {
            0: '未审核',
            1: '正在审核',
            2: '审核通过',
            3: '审核未通过',
            4: '下架',
            5: '上架发布'
        },
        /** 品牌管理 */
        Brands: {
            /** 产品标签 */
            Tags: {
                401: '奢',
                402: '豪',
                403: '舒',
                404: '简'
            }
        }
    }
};
